{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "Convolution2D",
            "config": {
                "subsample": [
                    2,
                    2
                ],
                "nb_filter": 24,
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "input_dtype": "float32",
                "border_mode": "valid",
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "nb_col": 5,
                "nb_row": 5,
                "trainable": true,
                "activation": "linear",
                "name": "convolution2d_1",
                "batch_input_shape": [
                    null,
                    160,
                    320,
                    3
                ]
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_1"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "subsample": [
                    2,
                    2
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "border_mode": "valid",
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "nb_col": 5,
                "nb_row": 5,
                "trainable": true,
                "activation": "linear",
                "name": "convolution2d_2",
                "nb_filter": 36
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_2"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "subsample": [
                    2,
                    2
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "border_mode": "valid",
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "nb_col": 5,
                "nb_row": 5,
                "trainable": true,
                "activation": "linear",
                "name": "convolution2d_3",
                "nb_filter": 48
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_3"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "border_mode": "valid",
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "nb_col": 3,
                "nb_row": 3,
                "trainable": true,
                "activation": "linear",
                "name": "convolution2d_4",
                "nb_filter": 64
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_4"
            }
        },
        {
            "class_name": "Convolution2D",
            "config": {
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "border_mode": "valid",
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "nb_col": 3,
                "nb_row": 3,
                "trainable": true,
                "activation": "linear",
                "name": "convolution2d_5",
                "nb_filter": 64
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_5"
            }
        },
        {
            "class_name": "Flatten",
            "config": {
                "trainable": true,
                "name": "flatten_1"
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "input_dim": null,
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "output_dim": 50,
                "trainable": true,
                "activation": "linear",
                "name": "dense_1"
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_6"
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "p": 0.5,
                "trainable": true,
                "name": "dropout_1"
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "input_dim": null,
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "output_dim": 10,
                "trainable": true,
                "activation": "linear",
                "name": "dense_2"
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "trainable": true,
                "activation": "relu",
                "name": "activation_7"
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "p": 0.5,
                "trainable": true,
                "name": "dropout_2"
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "input_dim": null,
                "W_constraint": null,
                "b_regularizer": null,
                "bias": true,
                "b_constraint": null,
                "W_regularizer": null,
                "activity_regularizer": null,
                "init": "glorot_uniform",
                "output_dim": 1,
                "trainable": true,
                "activation": "linear",
                "name": "dense_3"
            }
        }
    ],
    "keras_version": "1.1.1"
}