{
    "config": [
        {
            "config": {
                "activation": "linear",
                "nb_row": 5,
                "W_regularizer": null,
                "nb_col": 5,
                "init": "glorot_uniform",
                "nb_filter": 24,
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "name": "convolution2d_1",
                "subsample": [
                    2,
                    2
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "batch_input_shape": [
                    null,
                    160,
                    320,
                    3
                ],
                "b_regularizer": null,
                "border_mode": "valid",
                "input_dtype": "float32"
            },
            "class_name": "Convolution2D"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_1"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "activation": "linear",
                "nb_row": 5,
                "W_regularizer": null,
                "nb_col": 5,
                "init": "glorot_uniform",
                "nb_filter": 36,
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "name": "convolution2d_2",
                "subsample": [
                    2,
                    2
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "border_mode": "valid"
            },
            "class_name": "Convolution2D"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_2"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "activation": "linear",
                "nb_row": 5,
                "W_regularizer": null,
                "nb_col": 5,
                "init": "glorot_uniform",
                "nb_filter": 48,
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "name": "convolution2d_3",
                "subsample": [
                    2,
                    2
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "border_mode": "valid"
            },
            "class_name": "Convolution2D"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_3"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "activation": "linear",
                "nb_row": 3,
                "W_regularizer": null,
                "nb_col": 3,
                "init": "glorot_uniform",
                "nb_filter": 64,
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "name": "convolution2d_4",
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "border_mode": "valid"
            },
            "class_name": "Convolution2D"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_4"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "activation": "linear",
                "nb_row": 3,
                "W_regularizer": null,
                "nb_col": 3,
                "init": "glorot_uniform",
                "nb_filter": 64,
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "name": "convolution2d_5",
                "subsample": [
                    1,
                    1
                ],
                "dim_ordering": "tf",
                "W_constraint": null,
                "b_regularizer": null,
                "border_mode": "valid"
            },
            "class_name": "Convolution2D"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_5"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "trainable": true,
                "name": "flatten_1"
            },
            "class_name": "Flatten"
        },
        {
            "config": {
                "activation": "linear",
                "output_dim": 100,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "input_dim": null,
                "name": "dense_1",
                "b_regularizer": null,
                "W_constraint": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_6"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "trainable": true,
                "name": "dropout_1",
                "p": 0.5
            },
            "class_name": "Dropout"
        },
        {
            "config": {
                "activation": "linear",
                "output_dim": 50,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "input_dim": null,
                "name": "dense_2",
                "b_regularizer": null,
                "W_constraint": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_7"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "trainable": true,
                "name": "dropout_2",
                "p": 0.5
            },
            "class_name": "Dropout"
        },
        {
            "config": {
                "activation": "linear",
                "output_dim": 10,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "input_dim": null,
                "name": "dense_3",
                "b_regularizer": null,
                "W_constraint": null
            },
            "class_name": "Dense"
        },
        {
            "config": {
                "activation": "relu",
                "trainable": true,
                "name": "activation_8"
            },
            "class_name": "Activation"
        },
        {
            "config": {
                "trainable": true,
                "name": "dropout_3",
                "p": 0.5
            },
            "class_name": "Dropout"
        },
        {
            "config": {
                "activation": "linear",
                "output_dim": 1,
                "W_regularizer": null,
                "init": "glorot_uniform",
                "bias": true,
                "trainable": true,
                "activity_regularizer": null,
                "b_constraint": null,
                "input_dim": null,
                "name": "dense_4",
                "b_regularizer": null,
                "W_constraint": null
            },
            "class_name": "Dense"
        }
    ],
    "keras_version": "1.1.1",
    "class_name": "Sequential"
}